{
    "season-1": {
        "ano": "2006",
        "resumo": "A série apresenta o protagonista e o passado sangrento de Dexter, da infância com a família adotiva, após a morte de sua mãe. Com um humor particular, o analista forense tem uma vida dupla, com tendências psicopatas, que esconde da namorada Rita. Enquanto isso, um vilão chamado Ice Truck Killer, o ITK, começa a ser investigado pela polícia por espalhar partes de corpos mutilados pela cidade. Enquanto Dexter persegue ITK, sua irmã Debra (Jennifer Carpenter) se envolve com o médico Rudy.",
        "ep01": "Dexter",
        "ep02": "Crocodile",
        "ep03": "Popping Cherry",
        "ep04": "Let's Give the Boy a Hand",
        "ep05": "Love American Style",
        "ep06": "Return to Sender",
        "ep07": "Circle of Friends",
        "ep08": "Shrink Wrap",
        "ep09": "Father Knows Best",
        "ep10": "Seeing Red",
        "ep11": "Truth Be Told",
        "ep12": "Born Free"
    },

    "season-2": {
        "ano": "2007",
        "resumo": "Com a mudança de Debra para o apartamento de Dexter, as coisas ficam mais difíceis. Ele tenta se comportar como uma pessoa normal, já que está na companhia da irmã e também sob suspeita do sargento Doakes. Nesse período surge Lila, uma psicopata que ajuda Dexter a lidar com sua raiva e a presença do agente do FBI Lundy na cidade",
        "ep01": "It's Alive!",
        "ep02": "Waiting to Exhale",
        "ep03": "An Inconvenient Lie",
        "ep04": "See-Through",
        "ep05": "The Dark Defender",
        "ep06": "Dex, Lies, and Videotape",
        "ep07": "That Night, A Forest Grew",
        "ep08": "Morning Comes",
        "ep09": "Resistance Is Futile",
        "ep10": "There's Something About Harry",
        "ep11": "Left Turn Ahead",
        "ep12": "The British Invasion"
    },

    "season-3": {
        "ano": "2008",
        "resumo": "Em crise ética com sua natureza assassina, Dexter sofre com as consequências de seus atos. Sua confiança no promotor Miguel Prado entra em risco quando o sujeito passa a figurar no código mortal de Dexter. É nessa temporada que Rita descobre que está grávida. Dexter vai ser papai.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    },

    "season-4": {
        "ano": "2009",
        "resumo": "Uma das melhores temporadas, a continuação premiada com Globo de Ouro e Emmy prossegue ao narrar a nova rotina de Dexter, como pai de família. No episódio mais visto até então, no canal Showtime, Dexter conhece Trinity Killer, um assassino há mais de 30 anos e Debra cresce na temporada, após a morte do namorado. Em uma das cenas mais inesperadas, Dexter enfrenta Trinity Killer e ao chegar em casa descobre que sua família pagou um preço alto.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    },

    "season-5": {
        "ano": "2010",
        "resumo": "Ao começar exatamente no final da temporada anterior, a série ganha nova dinâmica. Agora Dexter precisa reunir forças para lidar com a perda na família. Enquanto enfrenta o luto, o serial killer conhece a jovem Lumen, uma das vítimas do assassino Dark Passenger, que também vai para a mesa de Dexter. O agente Liddy começa a desconfiar da integridade do protagonista e a irmã de Dexter segue confiante em sua fase na delegacia.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    },

    "season-6": {
        "ano": "2011",
        "resumo": "Grandes momentos. Dois fanáticos religiosos, o professor James Gellar e Travis criam cenas aterrorizantes a partir de inspirações bíblicas e logo entram no radar do protagonista. Em um jogo de perseguição, Dexter coloca em risco sua família e o grande segredo do analista forense é descoberto pela irmã.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    },

    "season-7": {
        "ano": "2012",
        "resumo": "Com grandes mudanças, a trama deixa de apresentar um grande inimigo por temporada e foca na relação de Dexter com Debra, após ter seu segredo revelado. Medo, negação e repulsa assombram a detetive e ela não consegue acreditar em seu irmão. Isso muda um pouco quando Debra é salva por Dexter de um assassino. É aqui que o protagonista conhece Hannah, e se identifica com a 'versão feminina de si.' A mulher logo vira desafeto de Debra e Dexter se vê dividido.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    },

    "season-8": {
        "ano": "2013",
        "resumo": "Para coroar o grande final da série, Dexter ganha mais um vilão. O sujeito arranca pedaços do cérebro de suas vítimas depois de mortas. Com a chegada da Dra. Evelyn Voguel, a privacidade de Dexter é invadida e a série debate ideias filosóficas sobre a escuridão na natureza humana. O protagonista precisa manter o filho em segurança, e Hannah vai ajudá-lo com isso. Debra está em seu momento mais frágil, e sua despedida é emocionante.",
        "ep01": "",
        "ep02": "",
        "ep03": "",
        "ep04": "",
        "ep05": "",
        "ep06": "",
        "ep07": "",
        "ep08": "",
        "ep09": "",
        "ep10": "",
        "ep11": "",
        "ep12": ""
    }
}